<a href="https://colab.research.google.com/github/norvin2002/coding101-start/blob/master/Sample_Code_Data_Science_101_Session_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

DataFrame.describe

In [ ]:
import pandas as pd
df = pd.DataFrame({'categotical':pd.Categorical(['d' , 'e', 'f' ]),
'numeric' : [1,2,3],
'object' : ['a','b','c']})

df.describe()

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [ ]:
import pandas as pd
data = [
        {'name':'Alex','age':20,'salary':1050},
        {'name':'Bob','age':52,'salary':1400},
        {'name':'Cat','age':23,'salary':1690}
]

df = pd.DataFrame(data,columns = ['name','age','salary'])

df.describe()

             age       salary
count   3.000000     3.000000
mean   31.666667  1380.000000
std    17.672955   320.468407
min    20.000000  1050.000000
25%    21.500000  1225.000000
50%    23.000000  1400.000000
75%    37.500000  1545.000000
max    52.000000  1690.000000

In [ ]:
import pandas as pd
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

df1.describe()

             Age      Score
count   7.000000   7.000000
mean   15.857143  82.428571
std     1.214986  11.588171
min    15.000000  67.000000
25%    15.000000  75.000000
50%    15.000000  82.000000
75%    16.500000  90.000000
max    18.000000  98.000000